Repository: skyesuniverse/dysscreen_app_v1
Catalog: lib/l10n/app_*.arb
Languages: ms, zh

# homeLabel
source: Home
ms: Laman Utama
zh: 首页

# testLabel
source: Test
ms: Ujian
zh: 测试

# aboutLabel
source: About
ms: Tentang
zh: 关于

# welcome
source: Welcome to DysScreenDysScreen
ms: Selamat datang ke DysScreen
zh: 欢迎使用 DysScreenO

# app_intro
source: DysScreen, a user-friendly app crafted to assist parents and educators in the crucial task of assessing and screening for dyslexia in children.
ms: DysScreen, aplikasi mesra pengguna yang direka untuk membantu ibu bapa dan pendidik dalam tugas penting untuk menilai dan menapis disleksia dalam kalangan kanak-kanak
zh: 欢迎使用 DysScreen，这是一个旨在帮助家长和教育工作者筛查儿童是否患有失读症的应用程序。

source: About Dyslexia
ms: Tentang Disleksia
zh: 关于失读症

source: Language
ms: Bahasa
zh: 语言

# introTitle
source: Introduction to Dyslexia
ms: Pengenalan kepada Dyslexia
zh: 失读症介绍

# introText1
source: Dyslexia is a neurobiological learning disorder that causes problems in both accurate and fluent word recognition, as well as difficulty spelling and decoding words. Dyslexia, sometimes known as reading disability, is caused by specific differences in brain areas responsible for language processing.
ms: Disleksia adalah gangguan pembelajaran neurobiologi yang menyebabkan masalah dalam pengenalan perkataan yang tepat dan lancar, serta kesukaran dalam mengeja dan menerjemahkan perkataan. Disleksia, kadang-kadang dikenali sebagai ketidakupayaan membaca, disebabkan oleh perbezaan spesifik dalam kawasan otak yang bertanggungjawab untuk pemprosesan bahasa.
zh: 失读症是一种神经生物学学习障碍，会导致准确和流利的单词识别出现问题，拼写和解码单词也困难。失读症，有时被称为阅读障碍，是由大脑区域特定差异引起的，这些区域负责语言处理。

# introText2
source: Dyslexia is not caused by issues with intelligence, hearing, or vision. Most dyslexic children can do well in school with tutoring or a specialized education program. Emotional support is also very crucial.
ms: Disleksia tidak disebabkan oleh masalah dengan kecerdasan, pendengaran, atau penglihatan. Kebanyakan kanak-kanak disleksia boleh berjaya di sekolah dengan bimbingan tuisyen atau program pendidikan khas. Sokongan emosi juga sangat penting.
zh: 失读症不是由智力、听力或视力问题引起的。大多数失读症患儿可以通过辅导或专门的教育计划在学校取得良好的成绩。情感支持也非常重要。

# introText3
source: Although there is no cure for dyslexia, early testing and intervention bring the best results. Dyslexia can go undiagnosed for years and not be recognized until adulthood, but it is never too late to seek help.
ms: Walaupun tiada penawar untuk disleksia, ujian dan intervensi awal memberikan hasil terbaik. Disleksia boleh tidak dikenal pasti untuk tahun-tahun dan tidak dikenali sehingga dewasa, tetapi tidak pernah terlalu lewat untuk mencari bantuan.
zh: 虽然失读症没有治愈方法，但早期测试和干预效果最好。失读症可能多年未被诊断，并且直到成年才被认识，但寻求帮助永远不会太迟。

# commonSignsAndSymptomsTitle
source: Common Signs and Symptomsx
ms: Tanda-Tanda dan Simptom-Simptom Umum
zh: 常见征兆和症状

# openText
source: Dyslexia symptoms might be difficult to detect before a child begins school, but several early warning signs might indicate a problem. When a child reaches school age, the teacher may be the first to detect an issue. The severity of the issue varies, but it usually becomes obvious when the child begins to learn to read.
ms: Simptom disleksia mungkin sukar dikesan sebelum seorang kanak-kanak memulakan sekolah, tetapi beberapa tanda awal mungkin menunjukkan masalah. Apabila seorang kanak-kanak mencapai usia sekolah, guru mungkin yang pertama mendeteksi masalah. Keterukan masalah tersebut berbeza-beza, tetapi ia biasanya menjadi jelas apabila kanak-kanak itu mula belajar membaca.
zh: 在孩子开始上学之前，很难检测到失读症症状，但是几个早期预警信号可能表明存在问题。当孩子达到上学年龄时，老师可能是第一个发现问题的人。问题的严重程度各不相同，但通常在孩子开始学习阅读时变得明显。

# preschoolSymptomsCategory
source: Symptoms of dyslexia among preschoolers
ms: Simptom disleksia di kalangan kanak-kanak pra-sekolah
zh: 学龄前儿童的失读症症状

# primarySchoolSymptomsCategory
source: Symptoms of dyslexia among primary school children
ms: Simptom disleksia di kalangan kanak-kanak sekolah rendah
zh: 小学生失读症症状

# highSchoolSymptomsCategory
source: Symptoms of dyslexia among high school children
ms: Simptom disleksia di kalangan pelajar sekolah menengah
zh: 中学生失读症症状

# preschoolSymptomsSentence
source: Symptoms of dyslexia in a preschooler may include:
ms: Simptom disleksia pada kanak-kanak pra-sekolah mungkin termasuk:
zh: 学龄前儿童的失读症症状可能包括：

# primarySchoolSymptomsSentence
source: Symptoms of dyslexia in a primary school age child may include:
ms: Simptom disleksia pada kanak-kanak sekolah rendah mungkin termasuk:
zh: 小学生失读症症状可能包括：

# highSchoolSymptomsSentence
source: Symptoms of dyslexia in a high school student may include:
ms: Simptom disleksia pada pelajar sekolah menengah mungkin termasuk:
zh: 中学生失读症症状可能包括：

source: Speech delay
ms: Kelambatan pertuturan
zh: 言语延迟

source: Pronunciation issues
ms: Isu sebutan
zh: 发音问题

source: Rhyming and rhyme difficulties
ms: Kesusahan dalam berima
zh: 韵律和押韵困难

# difficultyWithLearningShapesColorsAndWritingName
source: Difficulty with Learning shapes, colors, and writing one's name
ms: Kesukaran dalam mempelajari bentuk, warna, dan menulis nama sendiri
zh: 学习形状、颜色和书写姓名的困难

# difficultyWithRecountingAStory
source: Difficulty with recounting a story in the correct order of events
ms: Kesukaran dalam mengisahkan sebuah cerita dalam urutan peristiwa yang betul
zh: 讲述故事时顺序混乱的困难

source: Difficulties with reading a single word
ms: Kesukaran dalam membaca satu perkataan
zh: 阅读单个单词的困难

# frequentlyConfusesSomeLettersWhenWriting
source: Frequently confuses some letters when writing, such as 'd' and 'b' or 'm' and 'w''
ms: Kerap keliru beberapa huruf semasa menulis, seperti 'd' dan 'b' atau 'm' dan 'w'
zh: 写字时经常混淆一些字母，如 'd' 和 'b' 或 'm' 和 'w'

# frequentlyWritesWordsBackwards
source: Frequently writes words backwards, such as writing 'pit' when the word 'tip' was intended
ms: Kerap menulis perkataan secara terbalik, seperti menulis 'pit' apabila perkataan 'tip' dimaksudkan
zh: 经常倒写单词，比如打 'pit' 而意思是 'tip'

# difficultyWithGrammar
source: Difficulty with grammar, such as learning prefixes or suffixes
ms: Kesukaran dalam tatabahasa, seperti mempelajari awalan atau akhiran
zh: 语法困难，比如学习前缀或后缀

# avoidsReadingAloudInClass
source: Prefers not to read aloud in class
ms: Lebih suka tidak membaca dengan kuat di dalam kelas
zh: 不喜欢在课堂上大声朗读

# avoidsActivitiesThatInvolveReading
source: Avoiding activities that involve reading
ms: Mengelakkan aktiviti yang melibatkan membaca
zh: 避免涉及阅读的活动

source: Poor reading
ms: Membaca yang lemah
zh: 阅读困难

# poorSpelling
source: Poor spelling, especially many misspellings of the same term in a single writing assignment
ms: Mengeja yang lemah, terutamanya banyak kesilapan mengeja bagi satu tugasan penulisan tunggal
zh: 拼写困难，尤其是在单个写作任务中拼写相同术语的错误很多

# problemsWithWritingSummaries
source: Facing problems with writing summaries
ms: Menghadapi masalah menulis ringkasan
zh: 写摘要的问题

# mythsAndFactsTitle
source: 5 Myths and Facts about Dyslexia
ms: 5 Mitos dan Fakta tentang Disleksia
zh: 关于失读症的5个迷思和事实

# introText
source: Dyslexia is a complex learning disorder affecting language processing, especially in reading and writing. Despite its widespread recognition, it is often surrounded by myths and misconceptions, leading to misunderstanding and stigma. Let's clarify some common myths:
ms: Disleksia adalah gangguan pembelajaran kompleks yang mempengaruhi pemprosesan bahasa, terutamanya dalam membaca dan menulis. Walaupun disleksia diiktiraf secara meluas, ia sering dikelilingi oleh mitos dan salah faham, menyebabkan salah faham dan stigma. Mari kita klarifikasi beberapa mitos biasa:
zh: 失读症是一种复杂的学习障碍，影响语言处理，尤其是阅读和写作。尽管它被广泛认可，但它经常被迷思和误解所包围，导致误解和耻辱。让我们澄清一些常见的迷思：

# myth1
source: Myth #1: Dyslexia is a sign of low intelligence
ms: Mitos #1: Disleksia adalah tanda kecerdasan rendah
zh: 迷思 #1：失读症是低智商的标志

# fact1
source: Fact: Dyslexia doesn't correlate with intelligence, as individuals with dyslexia often have average or above-average intelligence levels. They may have unique strengths in creativity, problem-solving, and visual-spatial reasoning.
ms: Fakta: Disleksia tidak berkorelasi dengan kecerdasan, kerana individu dengan disleksia sering memiliki tahap kecerdasan purata atau di atas purata. Mereka mungkin memiliki kekuatan unik dalam kreativiti, penyelesaian masalah, dan penalaran visual-keruangan.
zh: 事实：失读症与智力无关，因为失读症患者的智力水平往往是平均或高于平均水平的。他们可能在创造力、问题解决和视觉空间推理方面具有独特的优势。

# myth2
source: Myth #2: Dyslexia only affects reading
ms: Mitos #2: Disleksia hanya mempengaruhi membaca
zh: 迷思 #2：失读症只影响阅读

# fact2
source: Fact: Dyslexia, a condition characterized by difficulties in reading, can affect other language skills like spelling, writing, and verbal communication. It can also affect phonological awareness, fluency, comprehension, and word retrieval, impacting daily life and academic and professional success.
ms: Fakta: Disleksia, satu keadaan yang ditandai oleh kesulitan membaca, boleh mempengaruhi kemahiran bahasa lain seperti mengeja, menulis, dan komunikasi lisan. Ia juga boleh mempengaruhi kesedaran fonologi, kelancaran, pemahaman, dan pengambilan kata, mempengaruhi kehidupan harian dan kejayaan akademik dan profesional.
zh: 事实：失读症是一种以阅读困难为特征的疾病，还会影响拼写、写作和口头交流等其他语言技能。它还可能影响语音意识、流畅性、理解力和词汇检索，影响日常生活以及学术和职业成功。

# myth3
source: Myth #3: Dyslexia can be outgrown or cured with time
ms: Mitos #3: Disleksia boleh sembuh dengan masa
zh: 迷思 #3：失读症可以随时间消退

# fact3
source: Fact: Dyslexia is a lifelong condition that requires appropriate intervention and support to manage difficulties and develop coping strategies. Early identification and intervention are crucial for improving outcomes and minimizing its impact on academic and social functioning. Many individuals with dyslexia lead successful lives.
ms: Fakta: Disleksia adalah keadaan sepanjang hayat yang memerlukan intervensi dan sokongan yang sesuai untuk menguruskan kesulitan dan mengembangkan strategi penanganan. Pengenalan awal dan intervensi adalah penting untuk meningkatkan hasil dan meminimakan kesan negatifnya terhadap fungsi akademik dan sosial. Banyak individu dengan disleksia menjalani kehidupan yang berjaya.
zh: 事实：失读症是一种终身疾病，需要适当的干预和支持来管理困难并发展应对策略。早期识别和干预对于改善结果和最小化其对学术和社交功能的影响至关重要。许多失读症患者过着成功的生活。

# myth4
source: Myth #4: Dyslexia is caused by laziness or lack of effort
ms: Mitos #4: Disleksia disebabkan oleh kemalasan atau kekurangan usaha
zh: 迷思 #4：失读症是由懒惰或缺乏努力引起的

# fact4
source: Fact: Dyslexia is a neurological condition caused by brain structure and function differences, not laziness or motivation. Despite significant effort, dyslexic individuals still face persistent challenges in reading and language processing. Blaming them perpetuates stigma and hinders their efforts to seek support and accommodations.
ms: Fakta: Disleksia adalah keadaan neurologi yang disebabkan oleh perbezaan struktur dan fungsi otak, bukan kemalasan atau motivasi. Walaupun usaha yang besar, individu disleksia masih menghadapi cabaran yang berterusan dalam membaca dan pemprosesan bahasa. Menyalahkan mereka mengekalkan stigma dan menghalang usaha mereka untuk mencari sokongan dan penginapan.
zh: 事实：失读症是一种由大脑结构和功能差异引起的神经系统疾病，而不是懒惰或动力不足。尽管付出了巨大的努力，失读症患者仍然面临着阅读和语言处理方面的持续挑战。责怪他们会持续存在耻辱并阻碍他们寻求支持和住宿的努力。

# myth5
source: Myth #5: People with dyslexia see letters and words backward
ms: Mitos #5: Orang dengan disleksia melihat huruf dan kata-kata terbalik
zh: 迷思 #5：失读症患者看到字母和单词颠倒

# fact5
source: Fact: Dyslexia is not a visual impairment, but rather a condition affecting the ability to decode and recognize written words, leading to difficulties in reading fluency, accuracy, and comprehension, primarily due to phonological processing and language skills rather than visual perception.
ms: Fakta: Disleksia bukanlah gangguan penglihatan, tetapi keadaan yang mempengaruhi keupayaan untuk menterjemahkan dan mengenali perkataan bertulis, menyebabkan kesulitan dalam kelancaran membaca, ketepatan, dan pemahaman, terutamanya disebabkan oleh pemprosesan fonologi dan kemahiran bahasa bukan persepsi visual.
zh: 事实：失读症不是视觉障碍，而是一种影响解码和识别书面文字的条件，导致阅读流畅性、准确性和理解方面存在困难，主要是由于语音处理和语言技能而不是视觉感知。

# outroText
source: Dispelling myths and misconceptions about dyslexia is essential for fostering understanding, empathy, and support for individuals with the condition. By challenging stereotypes and promoting accurate information, we can create a more inclusive and supportive environment for individuals with dyslexia to thrive and reach their full potential.
ms: Memadamkan mitos dan salah faham tentang disleksia adalah penting untuk membina pemahaman, empati, dan sokongan untuk individu dengan keadaan tersebut. Dengan menantang stereotaip dan mempromosikan maklumat yang tepat, kita dapat mencipta persekitaran yang lebih inklusif dan sokongan untuk individu dengan disleksia untuk berkembang dan mencapai potensi penuh mereka.
zh: 消除关于失读症的迷思和误解对于培养对这种情况的理解、同情和支持至关重要。通过挑战刻板印象和促进准确的信息，我们可以为失读症患者创造一个更具包容性和支持性的环境，使他们能够茁壮成长并发挥他们的全部潜力。

# tips_for_dyslexia
source: Tips for Dyslexia: Supporting Individuals at Home, Preschool, and Primary School
ms: Tips untuk Disleksia: Menyokong Individu di Rumah, Prasekolah, dan Sekolah Rendah

# dyslexia_symptoms_description
source: Dyslexia symptoms might be difficult to detect before a child begins school, but several early warning signs might indicate a problem. When a child reaches school age, the teacher may be the first to detect an issue. The severity of the issue varies, but it usually becomes obvious when the child begins to learn to read.
ms: Gejala disleksia mungkin sukar dikesan sebelum kanak-kanak mula sekolah, tetapi beberapa tanda awal mungkin menunjukkan masalah. Apabila kanak-kanak mencapai usia sekolah, guru mungkin menjadi orang pertama yang mengesan masalah. Keterukan masalah bervariasi, tetapi ia biasanya menjadi jelas apabila kanak-kanak mula belajar membaca.

# tips_at_home
source: Tips for Dyslexia at Home:
ms: Tips untuk Disleksia di Rumah:

# home1
source: 1. Create a Dyslexia-Friendly Environment:
ms: 1. Cipta Sekitar Pembelajaran Yang Mesra Disleksia:

# home1_1
source: Provide a quiet, organized study space.
ms: Berikan ruang belajar yang tenang dan teratur.

# home1_2
source: Use color-coded labels and organizers.
ms: Gunakan label dan pengatur warna kod.

# home2
source: 2. Encourage Multisensory Learning:
ms: 2. Galakkan Pembelajaran Pelbagai Indra:

# home2_1
source: Use tactile activities to reinforce learning.
ms: Gunakan aktiviti taktil untuk menguatkan pembelajaran.

# home2_2
source: Incorporate movement into learning tasks.
ms: Gabungkan pergerakan ke dalam tugas pembelajaran.

# home3
source: 3. Foster a Growth Mindset:
ms: 3. Galakkan Minda Pertumbuhan:

# home3_1
source: Emphasize effort and progress.
ms: Tekankan usaha dan kemajuan.

# home3_2
source: Provide specific, constructive feedback.
ms: Berikan maklum balas yang spesifik dan membina.

# tips_at_preschool
source: Tips for Dyslexia at Preschool:
ms: Tips untuk Disleksia di Prasekolah:

# preschool1
source: 1. Develop Phonological Awareness:
ms: 1. Bangunkan Kesedaran Fonologi:

# preschool1_1
source: Play rhyming games and sing songs.
ms: Mainkan permainan berima dan nyanyikan lagu.

# preschool1_2
source: Practice sound blending and segmenting.
ms: Amalkan penggabungan bunyi dan pengasingan.

# preschool2
source: 2. Read Aloud and Shared Reading:
ms: 2. Bacakan dan Baca Bersama:

# preschool2_1
source: Read regularly and engage in shared reading.
ms: Bacakan secara berkala dan libatkan diri dalam pembacaan bersama.

# preschool2_2
source: Encourage participation and discussion.
ms: Galakkan penyertaan dan perbincangan.

# preschool3
source: 3. Build Vocabulary and Language Skills:
ms: 3. Bangunkan Perkataan dan Kemahiran Bahasa:

# preschool3_1
source: Encourage conversation and storytelling.
ms: Galakkan perbualan dan beritahikan cerita.

# preschool3_2
source: Use visual aids to enhance understanding.
ms: Gunakan bantuan visual untuk meningkatkan pemahaman.

# tips_at_primary_school
source: Tips for Dyslexia at Primary School:
ms: Tips untuk Disleksia di Sekolah Rendah:

# primary1
source: 1. Provide Structured Literacy Instruction:
ms: 1. Berikan Pengajaran Literasi Berstruktur:

# primary1_1
source: Advocate for explicit literacy instruction.
ms: Advokasi untuk pengajaran literasi eksplisit.

# primary1_2
source: Seek qualified educators trained in evidence-based programs.
ms: Cari pendidik yang berkelayakan yang dilatih dalam program berasaskan bukti.

# primary2
source: 2. Implement Assistive Technology:
ms: 2. Amalkan Teknologi Bantu:

# primary2_1
source: Introduce text-to-speech software and audiobooks.'
ms: Kenalkan perisian teks-ke-pelbagai suara dan buku audio.

# primary2_2
source: Teach effective use of assistive technology.
ms: Ajar penggunaan teknologi bantu yang berkesan.

# primary3
source: 3. Advocate for Accommodations and Support Services:
ms: 3. Advokasi untuk Penginapan dan Perkhidmatan Sokongan:

# primary3_1
source: Develop an individualized education plan.
ms: Bina rancangan pendidikan individu.

# primary3_2
source: Advocate for appropriate accommodations and services.
ms: Advokasi untuk penginapan dan perkhidmatan yang sesuai.

source: Frequently Asked Questions About Dyslexia
ms: Soalan Lazim Mengenai Disleksia

source: Resources and Support
ms: Sumber dan Sokongan

# list_of_Dyslexia_Organizations
source: Comprehensive List of Dyslexia Organizations: Malaysia and International
ms: Senarai Komprehensif Organisasi Disleksia: Malaysia dan Antarabangsa

source: International
ms: Antarabangsa

source: Website:
ms: Laman Web:

# dyslexia_assessment_screen_title
source: Dyslexia Assessment and Screening Test
ms: Ujian Penilaian dan Penyaringan Disleksia
zh: 阅读障碍评估和筛查测试

# assessment_description
source: This test is designed to provide valuable insights into your child's reading and writing abilities, helping to identify potential signs of dyslexia at an early stage. Throughout the test, instructions and questions will be given, your child will encounter engaging activities that assess key skills such as reading comprehension, phonological awareness, and writing proficiency. The assessment typically takes 10-15 minutes to complete, ensuring a thorough evaluation without causing fatigue for the child.
ms: Ujian ini direka untuk memberikan pandangan berharga tentang kemahiran membaca dan menulis anak anda, membantu mengenal pasti tanda-tanda potensi disleksia pada peringkat awal. Sepanjang ujian, arahan dan soalan akan diberikan, anak anda akan menghadapi aktiviti yang menarik yang menilai kemahiran penting seperti pemahaman membaca, kesedaran fonologi, dan kecekapan menulis. Penilaian ini biasanya mengambil masa 10-15 minit untuk dilengkapkan, memastikan penilaian menyeluruh tanpa menyebabkan keletihan kepada anak.
zh: 此测试旨在为您的孩子的阅读和写作能力提供宝贵的见解，帮助在早期识别可能的阅读障碍迹象。 在整个测试过程中，将提供说明和问题，您的孩子将遇到评估阅读理解、语音意识和写作能力等关键技能的吸引人的活动。 评估通常需要10-15分钟完成，确保对孩子进行全面评估而不会导致疲劳。

# enter_child_details_message
source: **Please enter your child's details below to begin the assessment.
ms: **Sila masukkan butiran anak anda di bawah untuk memulakan penilaian.
zh: **请在下面输入您的孩子的详细信息以开始评估。

# child_name_label
source: Child Name *
ms: Nama Anak *
zh: 孩子姓名 *

# gender_label
source: Gender *
ms: Jantina *
zh: 性别 *

# age_label
source: Age *
ms: Umur *
zh: 年龄 *

# start_test_button
source: Start Test
ms: Mulakan Ujian
zh: 开始测试

# name_validation_error_message
source: Please enter a valid name
ms: Sila masukkan nama yang sah
zh: 请输入有效姓名

# gender_validation_error_message
source: Please select a gender
ms: Sila pilih jantina
zh: 请选择性别

# age_validation_error_message
source: Please select the age
ms: Sila pilih umur
zh: 请选择年龄

# form_validation_error_message
source: Please complete the form
ms: Sila lengkapkan borang
zh: 请填写完整表格

# gender_placeholder
source: Gender *
ms: Jantina *
zh: 性别 *

# gender_male
source: Male
ms: Lelaki
zh: 男性

# gender_female
source: Female
ms: Perempuan
zh: 女性

# age_placeholder
source: Age *
ms: Umur *
zh: 年龄 *

# gender_0
source: Gender *
ms: Jantina *

# gender_1
source: Male
ms: Lelaki

# gender_2
source: Female
ms: Perempuan

# age_0
source: Age *
ms: Umur *

source: Question
ms: Soalan

source: Instruction
ms: Arahan

source: Quit the Test?
ms: Berhenti Ujian?

source: Are you sure?
ms: Adakah anda pasti?

source: Submit the test?
ms: Hantar Ujian?

source: Yes
ms: Ya

source: No
ms: Tidak

source: Please answer all the question
ms: Sila jawab semua soalan.

source: Test Result
ms: Keputusan Ujian

source: Child Name:
ms: Nama Anak:

source: Gender:
ms: Jantina:

source: Age:
ms: Umur:

source: years old
ms: tahun

source: Share Result
ms: Kongsi Keputusan
